<template>
  <div>
    <div class="infoBanner" style="background: url('sean-oulashin-KMn4VEeEPR8-unsplash.jpg') center/cover no-repeat">
      <h1>Пляжи букита</h1>
      <p class="my-4">Букит на Бали - это район на южном побережье острова, который известен своими прекрасными пляжами.
        Ниже я опишу некоторые из них:</p>
    </div>
    <div class="container">
      <div class="info-box" v-for="(item,index) in arr" :key="item.title">
        <div class="info-box-img">
          <img :src="item.img" alt="">
        </div>
        <div class="info-box-info">
          <h3 class="about-title">{{ item.title }}</h3>
          <p v-for="text in item.text">{{ text }}</p>
          <v-btn class="mt-4" :outlined="index % 2 === 0" color="success" :href="item.location">Локация</v-btn>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "beach",
  data() {
    return {
      arr: [
        {
          img: '/beach/Jimbaran-beach-sunset-Best-Sunset-View-in-Bali.jpg',
          title: 'Джимбаран',
          text: ['Джимбаран - это прекрасный пляж на южном побережье Бали, который привлекает туристов своими белоснежными песчаными пляжами, уютными ресторанами, расположенными на пляже, а также красивыми закатами. ', ' Пляж Джимбаран также славится своим богатым подводным миром, что делает его идеальным местом для занятий подводным плаванием и дайвингом.'],
          location: 'https://goo.gl/maps/SdjxrwwkMDNwqK4b6'
        },
        {
          img: '/beach/hiddenbeach1.jpg',
          title: 'Секрет Бич',
          text: ['Секрет Бич - это уединенный пляж на юго-западном побережье Бали, который доступен только через узкую тропу скалистого склона. ', 'На пляже нет инфраструктуры, поэтому здесь можно насладиться уединением и прекрасными видами на море и окружающие горы.'],
          location: 'https://goo.gl/maps/V2r6KLTecA6bERYF8'
        },
        {
          img: '/beach/Balangan-Beach-Viewpoint.jpg',
          title: 'Баланган',
          text: ['Баланган - это еще один красивый пляж на юго-западном побережье Бали, который славится своими белоснежными песчаными пляжами и красивыми прибрежными скалами. ', 'Пляж Баланган также популярен среди серферов благодаря своим хорошим волнам.'],
          location: 'https://goo.gl/maps/DSosGFyevR61sKsU8'
        },
        {
          img: '/beach/impos4.jpg',
          title: 'Импосибл пляж',
          text: ['Импосибл - это красивый пляж на южном побережье Бали, расположенный между пляжами Паданг-Паданг и Бинджин. Его название происходит от трудного доступа к пляжу через узкий проход между скалами, который иногда может быть закрыт приливом. Однако, пройдя через этот проход, посетители смогут насладиться кристально чистой водой, белым песком и удивительным видом на окружающие скалы.'],
          location: 'https://goo.gl/maps/zCTe8LM75gx1o1E5A'
        },
        {
          img: '/beach/dreamland-beach.jpg',
          title: 'Дримленд',
          text: ['Дримленд - это красивый пляж на юго-западном побережье Бали, который привлекает туристов своими белоснежными песчаными пляжами, уютными ресторанами, расположенными на пляже, а также прекрасными закатами.', 'Дримленд также является популярным местом для занятий серфингом благодаря своим хорошим волнам.'],
          location: 'https://goo.gl/maps/dyM9arxDyUddEso96'
        },
        {
          img: '/beach/o-plyazhe-padang-padang-na-ostrove-bali.jpg',
          title: 'Паданг-Паданг',
          text: ['Пляж Паданг-Паданг  находится на юго-западном побережье Бали и является одним из самых популярных пляжей острова. Этот пляж славится своим кристально чистым теплым морем и белым песком, который обрамляют скалы известняка, создавая неповторимую атмосферу уединения и спокойствия.', ' На Паданг-Паданге можно насладиться плаванием в океане, заняться серфингом или просто отдохнуть в тени пальмовых деревьев, наслаждаясь красивым видом на море.'],
          location: 'https://goo.gl/maps/4BqYpou8PBysZT2B8'
        },
        {
          img: '/beach/uluwatu2.jpg',
          title: 'Улувату',
          text: ['Улувату Бич является одним из самых известных пляжей на Бали, известным своими впечатляющими высокими волнами, которые делают его одним из лучших мест для серфинга в мире. ', ' Но пляж также славится своим красивым окружением: высокие скалы, облепленные зеленью и океаном, создают впечатляющий пейзаж, который привлекает туристов со всего мира. Помимо серфинга, здесь можно заняться дайвингом, отдохнуть на пляже или посетить храм Улувату, расположенный недалеко от пляжа.'],
          location: 'https://goo.gl/maps/wh3dvUestpbUS8qMA'
        },
        {
          img: '/beach/25255BUNSET25255D-248.jpg',
          title: 'Ньянг Ньянг',
          text: ['Ньянг Ньянг - это пляж, расположенный на юго-западном побережье Бали, Индонезия. Пляж славится своей красотой и тихой атмосферой, песчаным берегом, изумительными видами на океан и залив, а также возможностью заняться серфингом благодаря хорошим волнам.', 'Несмотря на то, что Ньянг Ньянг находится относительно близко к популярным курортам, он является уединенным и тихим местом, идеальным для тех, кто ищет отдых вдали от суеты.'],
          location: ''
        },
      ]
    }
  }
}
</script>

<style scoped>

</style>
